app/Controllers/Home.php

SELECT *
FROM `tblaccount_expense`
---
    public function manageExpenses()
    {
        //rentals
        $builder = $this->db->table('tblrental a');
        $builder->select('a.*,b.Description');
        $builder->join('tblaccount_expense b','b.expID=a.expID','LEFT');
        $builder->WHERE('a.Status<>',0);
        $rental = $builder->get()->getResult();