app/Controllers/Home.php

SELECT IFNULL(SUM(Payment), 0)total
FROM `tblrental_payment`
WHERE `Status` = 0
AND DATE_FORMAT(Date,"%m") = '07'
AND DATE_FORMAT(Date,"%Y") = '2024'
GROUP BY DATE_FORMAT(Date, "%m"), DATE_FORMAT(Date, "%Y")
SELECT IFNULL(SUM(p_amount_in_figures), 0)total
FROM `payment_info_master`
WHERE `status` = 6
AND DATE_FORMAT(p_date,"%m") = '07'
AND DATE_FORMAT(p_date,"%Y") = '2024'
GROUP BY DATE_FORMAT(p_date, "%m"), DATE_FORMAT(p_date, "%Y")
---
    public function index()
    {
        //get the total expenses
        $rent = 0;
        $builder = $this->db->table('tblrental_payment');
        $builder->select('IFNULL(SUM(Payment),0)total');
        $builder->WHERE('Status',0);
        $builder->WHERE('DATE_FORMAT(Date,"%m")',date('m'))->WHERE('DATE_FORMAT(Date,"%Y")',date('Y'));
        $builder->groupBy('DATE_FORMAT(Date,"%m")')->groupBy('DATE_FORMAT(Date,"%Y")');
        $data = $builder->get();
        if($row = $data->getRow())
        {
            $rent = $row->total;
        }
        //total other expenses
        $current_expense=0;
        $builder = $this->db->table('payment_info_master');
        $builder->select('IFNULL(SUM(p_amount_in_figures),0)total');
        $builder->WHERE('status',6);
        $builder->WHERE('DATE_FORMAT(p_date,"%m")',date('m'));
        $builder->WHERE('DATE_FORMAT(p_date,"%Y")',date('Y'));
        $builder->groupBy('DATE_FORMAT(p_date,"%m")');
        $builder->groupBy('DATE_FORMAT(p_date,"%Y")');
        $data = $builder->get();

SELECT `a`.*, `b`.`Description`
FROM `tblrental` `a`
LEFT JOIN `tblaccount_expense` `b` ON `b`.`expID`=`a`.`expID`
WHERE `a`.`Status` <> 0
---
    public function manageExpenses()
    {
        //rentals
        $builder = $this->db->table('tblrental a');
        $builder->select('a.*,b.Description');
        $builder->join('tblaccount_expense b','b.expID=a.expID','LEFT');
        $builder->WHERE('a.Status<>',0);
        $rental = $builder->get()->getResult();

SELECT SUM(TotalAmount)Total
FROM `tblrental`
WHERE `Status` = 1
SELECT SUM(Payment)Total
FROM `tblrental_payment`
WHERE `Status` = 0
SELECT SUM(Payment)Total
FROM `tblrental_payment`
WHERE `Status` = 1
---
    public function rentExpense()
    {
        //variables
        $totalContract = 0;$totalPending=0;$totalPaid=0;
        //compute the total contract price
        $builder = $this->db->table('tblrental');
        $builder->select('SUM(TotalAmount)Total');
        $builder->WHERE('Status',1);
        $contract = $builder->get();
        if($row = $contract->getRow())
        {
            $totalContract=$row->Total;
        }
        //get the total pending
        $builder = $this->db->table('tblrental_payment');
        $builder->select('SUM(Payment)Total');
        $builder->WHERE('Status',0);
        $pending = $builder->get();
        if($row = $pending->getRow())
        {
            $totalPending = $row->Total;
        }
        //get the total paid
        $builder = $this->db->table('tblrental_payment');
        $builder->select('SUM(Payment)Total');
        $builder->WHERE('Status',1);
        $paid = $builder->get();