app/Controllers/ManageController.php

SELECT `Date`
FROM `tblrental_payment`
WHERE DATE_FORMAT(Date,"%m") = '10'
AND DATE_FORMAT(Date,"%Y") = '2024'
---
    public function generateRentExpense()
    {
        $rentalPayment = new \App\Models\rentalPaymentModel();
        $rentModel = new \App\Models\rentalModel();
        $month = $this->request->getPost('month');
        $year = $this->request->getPost('year');
        $item = $this->request->getPost('itemID');
        $count = count((array)$item);
        //apply validation
        $validation = $this->validate([
            'month'=>'required',
            'year'=>'required',
        ]);
        if(!$validation)
        {
            echo "Invalid! Please select month and year to generate";
        }
        else
        {
            if($count==0)
            {
                echo "Invalid! Please select item(s) to generate";
            }
            else
            {
                //check if month and year already loaded
                $builder = $this->db->table('tblrental_payment');
                $builder->select('Date');
                $builder->WHERE('DATE_FORMAT(Date,"%m")',$month);
                $builder->WHERE('DATE_FORMAT(Date,"%Y")',$year);
                $data = $builder->get();