app/Controllers/ManageController.php

    public function pendingRentExpense()
    {
        $builder = $this->db->table('tblrental_payment a');
        $builder->select('a.rpID,a.Payment,a.Date,a.Status,a.Attachment,b.Payee,b.Details,c.Description');
        $builder->join('tblrental b','b.rentalID=a.rentalID','LEFT');
        $builder->join('tblaccount_expense c','c.expID=b.expID','LEFT');
        $builder->WHERE('a.Status<>',3);
        $builder->orderBy('a.Status','ASC');
        $data = $builder->get();
---
SELECT `a`.`rpID`, `a`.`Payment`, `a`.`Date`, `a`.`Status`, `a`.`Attachment`, `b`.`Payee`, `b`.`Details`, `c`.`Description`
FROM `tblrental_payment` `a`
LEFT JOIN `tblrental` `b` ON `b`.`rentalID`=`a`.`rentalID`
LEFT JOIN `tblaccount_expense` `c` ON `c`.`expID`=`b`.`expID`
WHERE `a`.`Status` <> 3
ORDER BY `a`.`Status` ASC